/* ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ */
/* 3/4 트리거 */
/* ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ */
CREATE TRIGGER tr_after_crt_mnofc
/******************************************************************************
    프로그램명 : tr_after_crt_mnofc 
      수행목적 : 부처 정보 생성 트리거
      수행결과 : 기관기본정보의 위탁기관과 관장기관의 정보를 바탕으로 부처정보를 구성한다. - 부처상위기관(=관장기관), 부처하위기관(=위탁기관)
 ------------------------------------------------------------------------------
     수정일자     수정자    수정내용
 ------------------------------------------------------------------------------
     2024.01.09   홍길동  최초 작성
 ******************************************************************************/
AFTER INSERT OR DELETE
ON INST_BSC
FOR EACH ROW EXECUTE PROCEDURE fn_crt_mnofc();

/* ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ */
/* 4/4 트리거 COMMENT */
/* ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ */
/* COMMENT ON TRIGGER tr_after_crt_mnofc ON INST_BSC IS '부처 정보 생성 트리거'; */