CREATE SEQUENCE irb_evl_sn_seq
/******************************************************************************
    프로그램명 : irb_evl_sn_seq 
      수행목적 : 시쿼스 조회 후 반환한다.
      수행결과 : 시쿼스 반환
 ------------------------------------------------------------------------------
     수정일자     수정자    수정내용
 ------------------------------------------------------------------------------
     2023.12.18   홍길동  최초 작성
 ------------------------------------------------------------------------------
	Ex.> 예시     
	1. 시퀀스 조회
		▶ SELECT NEXTVAL('IRB_EVL_SN_SEQ')
 ******************************************************************************/
	INCREMENT BY 1
	MINVALUE 1
	MAXVALUE 9223372036854775807
	START 1
	CACHE 1
	NO CYCLE;
	
COMMENT ON SEQUENCE irb_evl_sn_seq IS '국제감축사업평가상세 평가일련번호 시퀀스';