CREATE SEQUENCE user_actv_dsctn_seq
/******************************************************************************
    프로그램명 : user_actv_dsctn_seq 
      수행목적 : 시쿼스 조회 후 반환한다.
      수행결과 : 시쿼스 반환
 ------------------------------------------------------------------------------
     수정일자     수정자    수정내용
 ------------------------------------------------------------------------------
     2023.12.18   홍길동  최초 작성
 ------------------------------------------------------------------------------
	Ex.> 예시     
	1. 시퀀스 조회
		▶ SELECT NEXTVAL('USER_ACTV_DSCTN_SEQ')
 ******************************************************************************/
	INCREMENT BY 1
	MINVALUE 1
	MAXVALUE 9223372036854775807
	START 1
	CACHE 1
	NO CYCLE;
	
COMMENT ON SEQUENCE user_actv_dsctn_seq IS '사용자활동내역 일련번호 시퀀스';